programming/book/97_things_every_programmer_should_know.org
#+setupfile: ../../styles/readtheorg.setup
#+title: 97 Things Every Programmer Should Know

* API
** Convenience Is Not an -ility

APIs are supposed to hide underlying complexity.

A good API follows a consistent level of abstraction, exhibits consistency and symmetry, and forms the vocabulary for an expressive language, which enables the next layer above to ask and answer useful questions.

A diverse vocabulary allows us to express subtleties in meaning. For example, we prefer to say =run()= instead of =walk(true)=.

** The Golden Rule of API Design

When designing and API, you have to think about how you might change it in the future and whether the changes might break client code. The easiest way is to lock down the API, present the API through a singleton or use =static= factory methods to guard it from people who might override behavior.

It's not enough to write tests for an API you develop; you have to write unit tests for code that uses your API. 

* Architecture
** Better Scalability in Parallel Systems

Concurrency, and especially parallelism, a special subset of concurrency is hard. Almost all the _problems of concurrency relate to the use of shared mutable memory_: race conditions, deadlock, livelock, etc.

Harnessing true parallelism becomes more important, because computers have more cores, and we can no longer rely on increasing processor clock speeds to improve application performance.

Instead of using threads and shared memory as programming model, we can use processes and message passing. Such systems do not have all the synchronization stresses that shared-memory, multithreaded systems have. Use — or, if they don't exist, create — libraries and frameworks that provide process models and message passing, avoiding all use of shared mutable memory.

A formal model, Communicating Sequential Processes (CSP), can be applied as part of the engineering of such systems.

Alternatively we can adopt dataflow systems as a way of computing. In a dataflow system, there is no explicitly programmed control flow. Instead, a directed graph of operators, connected by data paths, is set up and then data is fed into the system. Evaluation is controlled by the readiness of data within the system. There is no synchronization problem.

** Large, Interconnected Data Belongs to a Database

+Embedded database systems+ can be linked as libraries directly into the application, requiring almost no setup or management. Two notable open source ones are SQLite and HSQLDB.

If the application's data is larger than the system's RAM, an indexed RDBMS table will perform orders of magnitude faster than the library's map collection type, which will thrash virtual memory pages.

Another advantage of basing code around an RDBMS involves the handling of relationships between data elements. You can describe consistency constraints on data in a declarative way, avoiding the risk of the dangling pointers if you forget to update data in an edge case.

You can also create efficient links between the entities stored in the database at any time, simply by creating an index.

Coding around a database allows multiple applications to access data in a safe way. This makes it easy to upgrade the application for concurrent use and also to code each part of the application using the most appropriate language and platform.

RDBMS will optimize SQL commands, allowing you to concentrate on the application's functionality rather than on algorithmic tuning.

* Basics
