programming/book/97_things_every_programmer_should_know.html
---
title: "97 Things Every Programmer Should Know"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>97 Things Every Programmer Should Know</title>
<!-- 2017-03-01 Wed 22:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>







</head>
<body>
<div id="content">
<h1 class="title">97 Things Every Programmer Should Know</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. API</a>
<ul>
<li><a href="#sec-1-1">1.1. Convenience Is Not an -ility</a></li>
<li><a href="#sec-1-2">1.2. The Golden Rule of API Design</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Architecture</a>
<ul>
<li><a href="#sec-2-1">2.1. Better Scalability in Parallel Systems</a></li>
<li><a href="#sec-2-2">2.2. Large, Interconnected Data Belongs to a Database</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Basics</a>
<ul>
<li><a href="#sec-3-1">3.1. Floating-Point Numbers</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Build</a>
<ul>
<li><a href="#sec-4-1">4.1. Keep the Build Clean</a></li>
<li><a href="#sec-4-2">4.2. The Linker</a></li>
<li><a href="#sec-4-3">4.3. Own and Refactor the Build</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Code Analysis</a>
<ul>
<li><a href="#sec-5-1">5.1. Automate Coding Standard</a></li>
<li><a href="#sec-5-2">5.2. Code Analysis Tools</a></li>
<li><a href="#sec-5-3">5.3. Dirty Code Bombs</a></li>
<li><a href="#sec-5-4">5.4. Let Your Project Speak for Itself</a></li>
<li><a href="#sec-5-5">5.5. Write Small Functions Using Examples</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Coding</a>
<ul>
<li><a href="#sec-6-1">6.1. Before You Refactor</a></li>
<li><a href="#sec-6-2">6.2. Beware the Share</a></li>
<li><a href="#sec-6-3">6.3. Code Layout Matters</a></li>
<li><a href="#sec-6-4">6.4. Coding with Reason</a></li>
<li><a href="#sec-6-5">6.5. Improve Code by Removing It</a></li>
<li><a href="#sec-6-6">6.6. Know Your Next Commit</a></li>
<li><a href="#sec-6-7">6.7. Only the Code Tells the Truth</a></li>
<li><a href="#sec-6-8">6.8. Read Code</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Commenting</a>
<ul>
<li><a href="#sec-7-1">7.1. A Comment on Comments</a></li>
<li><a href="#sec-7-2">7.2. Comment Only What the Code Cannot Say</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Debugging</a>
<ul>
<li><a href="#sec-8-1">8.1. Check Your Code First</a></li>
<li><a href="#sec-8-2">8.2. How to Use a Bug Tracker</a></li>
<li><a href="#sec-8-3">8.3. Two Wrongs Can Make a Right</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Deployment</a>
<ul>
<li><a href="#sec-9-1">9.1. Deploy Early and Often</a></li>
<li><a href="#sec-9-2">9.2. Don't Touch That Code!</a></li>
<li><a href="#sec-9-3">9.3. One Binary</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Design Principles</a>
<ul>
<li><a href="#sec-10-1">10.1. Don't Repeat Yourself</a></li>
<li><a href="#sec-10-2">10.2. The Single Responsibility Principle</a></li>
<li><a href="#sec-10-3">10.3. Thinking in States</a></li>
</ul>
</li>
<li><a href="#sec-11">11. Design Patterns</a>
<ul>
<li><a href="#sec-11-1">11.1. The Singleton Pattern</a></li>
</ul>
</li>
<li><a href="#sec-12">12. Domains</a>
<ul>
<li><a href="#sec-12-1">12.1. Code in the Language of the Domain</a></li>
<li><a href="#sec-12-2">12.2. Prefer Domain-Specific Types</a></li>
</ul>
</li>
<li><a href="#sec-13">13. Errors</a>
<ul>
<li><a href="#sec-13-1">13.1. Business Exceptions</a></li>
<li><a href="#sec-13-2">13.2. Don't Ignore That Error!</a></li>
<li><a href="#sec-13-3">13.3. Prevent Errors</a></li>
<li><a href="#sec-13-4">13.4. Verbose Logging</a></li>
</ul>
</li>
<li><a href="#sec-14">14. Learning</a>
<ul>
<li><a href="#sec-14-1">14.1. Continuous Learning</a></li>
<li><a href="#sec-14-2">14.2. Deliberate Practice</a></li>
<li><a href="#sec-14-3">14.3. Hard Work Does Not Pay Off</a></li>
<li><a href="#sec-14-4">14.4. Know More Programming Languages</a></li>
<li><a href="#sec-14-5">14.5. Reinvent the Wheel Often</a></li>
</ul>
</li>
<li><a href="#sec-15">15. OOP</a>
<ul>
<li><a href="#sec-15-1">15.1. Encapsulate Behavior and State</a></li>
<li><a href="#sec-15-2">15.2. Polymorphism</a></li>
</ul>
</li>
<li><a href="#sec-16">16. Performance</a>
<ul>
<li><a href="#sec-16-1">16.1. Interprocess Communication</a></li>
<li><a href="#sec-16-2">16.2. Know Your Limits</a></li>
</ul>
</li>
<li><a href="#sec-17">17. Practice</a>
<ul>
<li><a href="#sec-17-1">17.1. Don't Rely on "Magic Happens Here"</a></li>
<li><a href="#sec-17-2">17.2. Learn to Estimate</a></li>
<li><a href="#sec-17-3">17.3. Make the Invisible More Visible</a></li>
<li><a href="#sec-17-4">17.4. The Boy Scout Rule</a></li>
</ul>
</li>
<li><a href="#sec-18">18. Quality</a>
<ul>
<li><a href="#sec-18-1">18.1. Code Is Design</a></li>
</ul>
</li>
<li><a href="#sec-19">19. Teamwork</a>
<ul>
<li><a href="#sec-19-1">19.1. Code Reviews</a></li>
<li><a href="#sec-19-2">19.2. Pair Program</a></li>
<li><a href="#sec-19-3">19.3. Start from Yes</a></li>
<li><a href="#sec-19-4">19.4. Two Heads Are Better Than One</a></li>
</ul>
</li>
<li><a href="#sec-20">20. Testing</a>
<ul>
<li><a href="#sec-20-1">20.1. Test for Required Behavior</a></li>
<li><a href="#sec-20-2">20.2. Testing Is the Engineering Rigor of Software Development</a></li>
<li><a href="#sec-20-3">20.3. Test Precisely and Concretely</a></li>
<li><a href="#sec-20-4">20.4. Test While You Sleep</a></li>
<li><a href="#sec-20-5">20.5. When Programmers and Testers Collaborate</a></li>
<li><a href="#sec-20-6">20.6. Write Tests for People</a></li>
</ul>
</li>
<li><a href="#sec-21">21. Tools</a>
<ul>
<li><a href="#sec-21-1">21.1. Command-Line Tools</a></li>
<li><a href="#sec-21-2">21.2. Step Back and Automate</a></li>
<li><a href="#sec-21-3">21.3. Unix Tools</a></li>
<li><a href="#sec-21-4">21.4. Version Control</a></li>
</ul>
</li>
<li><a href="#sec-22">22. Users</a>
<ul>
<li><a href="#sec-22-1">22.1. Customers Do Not Mean What They Say</a></li>
<li><a href="#sec-22-2">22.2. Read the Humanities</a></li>
<li><a href="#sec-22-3">22.3. What Would the User Do?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> API</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Convenience Is Not an -ility</h3>
<div class="outline-text-3" id="text-1-1">
<p>
APIs are supposed to hide underlying complexity.
</p>

<p>
A good API follows a consistent level of abstraction, exhibits consistency and symmetry, and forms the vocabulary for an expressive language, which enables the next layer above to ask and answer useful questions.
</p>

<p>
A diverse vocabulary allows us to express subtleties in meaning. For example, we prefer to say <code>run()</code> instead of <code>walk(true)</code>.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> The Golden Rule of API Design</h3>
<div class="outline-text-3" id="text-1-2">
<p>
When designing and API, you have to think about how you might change it in the future and whether the changes might break client code. The easiest way is to lock down the API, present the API through a singleton or use <code>static</code> factory methods to guard it from people who might override behavior.
</p>

<p>
It's not enough to write tests for an API you develop; you have to write unit tests for code that uses your API. 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Architecture</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Better Scalability in Parallel Systems</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Concurrency, and especially parallelism, a special subset of concurrency is hard. Almost all the <span class="underline">problems of concurrency relate to the use of shared mutable memory</span>: race conditions, deadlock, livelock, etc.
</p>

<p>
Harnessing true parallelism becomes more important, because computers have more cores, and we can no longer rely on increasing processor clock speeds to improve application performance.
</p>

<p>
Instead of using threads and shared memory as programming model, we can use processes and message passing. Such systems do not have all the synchronization stresses that shared-memory, multithreaded systems have. Use — or, if they don't exist, create — libraries and frameworks that provide process models and message passing, avoiding all use of shared mutable memory.
</p>

<p>
A formal model, Communicating Sequential Processes (CSP), can be applied as part of the engineering of such systems.
</p>

<p>
Alternatively we can adopt dataflow systems as a way of computing. In a dataflow system, there is no explicitly programmed control flow. Instead, a directed graph of operators, connected by data paths, is set up and then data is fed into the system. Evaluation is controlled by the readiness of data within the system. There is no synchronization problem.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Large, Interconnected Data Belongs to a Database</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<del>Embedded database systems</del> can be linked as libraries directly into the application, requiring almost no setup or management. Two notable open source ones are SQLite and HSQLDB.
</p>

<p>
If the application's data is larger than the system's RAM, an indexed RDBMS table will perform orders of magnitude faster than the library's map collection type, which will thrash virtual memory pages.
</p>

<p>
Another advantage of basing code around an RDBMS involves the handling of relationships between data elements. You can describe consistency constraints on data in a declarative way, avoiding the risk of the dangling pointers if you forget to update data in an edge case.
</p>

<p>
You can also create efficient links between the entities stored in the database at any time, simply by creating an index.
</p>

<p>
Coding around a database allows multiple applications to access data in a safe way. This makes it easy to upgrade the application for concurrent use and also to code each part of the application using the most appropriate language and platform.
</p>

<p>
RDBMS will optimize SQL commands, allowing you to concentrate on the application's functionality rather than on algorithmic tuning.
</p>
</div>
</div>
</div>
