programming/book/97_things_every_programmer_should_know.org
** Floating-Point Numbers

Floating-point numbers have limited precision. They are approximations of real numbers. Floating-point numbers are intended for efficient scientific computation.

#+caption: Floating-point numbers are not evenly spaced throughout their range:
#+begin_src c
float a = 2147483647;   // Largest 32-bit signed integer
printf("%f\n", a);      // 2147483648.000000
printf("%f\n", a - 64); // 2147483648.000000
printf("%f\n", a - 65); // 2147483520.000000
#+end_src

Because the spacing between adjacent floats in that range is 128, and floating-point operations round to the nearest floating-point number.

Don't use floating-point numbers for financial applications — that's what =decimal= classes in languages like Python and C# are for.

* Build
** Keep the Build Clean

Ignoring things is mental work. Get rid of all the unnecessary mental work. When something appears that it is unnecessary to see, deal with it right away, (instead of deciding if it is irrelevant every time it is encountered).

Keeping the build clean is not just about keeping it free of compilation errors or test failures: warnings are also an important and critical part of code hygiene.

** The Linker

A linker does:

- concatenate together the code and data sections of the object files
- connect the references to symbols with their definitions
- pull unresolved symbols out of the library
- write out an executable

#+caption: Declarations (normally in header files) generate external references to the symbols:
#+begin_src c
extern int foo; // Generates an external reference to the symbol "foo"
#+end_src

#+caption: Definitions (usually in implementation files) set aside storage for the symbols:
#+begin_src c
int foo = 3;
#+end_src

- Linker reports "multiply defined" when more than 1 definition is found for a symbol.
- Linker reports "unresolved symbol" when no definition is found for a symbol.

Linker generates a map file, which is a list of all the symbols in the executable, along with their addresses. This tells what modules were linked in from the library, and the sizes of each module. 

** Own and Refactor the Build

_The build is an essential part of the development process._ It _creates executable artifacts_ for developers and end users to test and run. It _defines the component architecture_ of the application. Build scripts are often written in a different language than source code.

Testing as we code is necessary to being able to deliver value predictably. In much the same way, the build process needs to be owned by the development team.

Automating configuration in the build can enable you to get consistent results when multiple people are working on a project, avoiding an "it works for me" conversation.

* Code Analysis
** Automate Coding Standard

One reason to format the code in a uniform way is so that nobody can "own" a piece of code by formatting it in his private way. 

- Make code formatting part of the build process.
- Use static code analysis tools to scan the code for antipatterns.
- Do not only measure test coverage, but automatically check the results. Break the build if test coverage is too low.

** Code Analysis Tools

Most languages, particularly ones branded dynamic, expose their abstract syntax tree and compiler tools as part of their standard library. These often contain hidden gems that are useful for static analysis and dynamic testing.

** Dirty Code Bombs

Measure and control the degree and depth of coupling and complexity of code. Software metrics can be used to count the occurrences of specific features in code.

- Fan-out: the number of classes referenced either directly or indirectly from a class of interest, or the count of all the classes that must be compiled before this class can be compiled.
- Fan-in: the count of all classes that depend upon the class of interest.

Instability factor: $I = \text{fo} / (\text{fi} + \text{fo})$. As $I$ approaches 0, the package becomes more stable. The goal in refactoring is to move $I$ closer to 0.

** Let Your Project Speak for Itself

Include static code analysis in continuous integration server to gather code metrics. Delegate this task to the project itself and rely on it to report when things get worse.

Give your project a voice by email or instant messaging, informing the developers about the latest decline or improvement in numbers. Use extreme feedback device (XFD) to drive a physical device such as a lamp, a toy robot, or even a USB rocket launcher, based on the results of the automatic analysis.

