programming/book/97_things_every_programmer_should_know.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Basics</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Floating-Point Numbers</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Floating-point numbers have limited precision. They are approximations of real numbers. Floating-point numbers are intended for efficient scientific computation.
</p>

<div class="org-src-container">
<label class="org-src-name">Floating-point numbers are not evenly spaced throughout their range:</label>
<pre class="src src-c"><span class="org-type">float</span> <span class="org-variable-name">a</span> = 2147483647;   <span class="org-comment-delimiter">// </span><span class="org-comment">Largest 32-bit signed integer</span>
printf(<span class="org-string">"%f\n"</span>, a);      <span class="org-comment-delimiter">// </span><span class="org-comment">2147483648.000000</span>
printf(<span class="org-string">"%f\n"</span>, a - 64); <span class="org-comment-delimiter">// </span><span class="org-comment">2147483648.000000</span>
printf(<span class="org-string">"%f\n"</span>, a - 65); <span class="org-comment-delimiter">// </span><span class="org-comment">2147483520.000000</span>
</pre>
</div>

<p>
Because the spacing between adjacent floats in that range is 128, and floating-point operations round to the nearest floating-point number.
</p>

<p>
Don't use floating-point numbers for financial applications — that's what <code>decimal</code> classes in languages like Python and C# are for.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Build</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Keep the Build Clean</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Ignoring things is mental work. Get rid of all the unnecessary mental work. When something appears that it is unnecessary to see, deal with it right away, (instead of deciding if it is irrelevant every time it is encountered).
</p>

<p>
Keeping the build clean is not just about keeping it free of compilation errors or test failures: warnings are also an important and critical part of code hygiene.
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> The Linker</h3>
<div class="outline-text-3" id="text-4-2">
<p>
A linker does:
</p>

<ul class="org-ul">
<li>concatenate together the code and data sections of the object files
</li>
<li>connect the references to symbols with their definitions
</li>
<li>pull unresolved symbols out of the library
</li>
<li>write out an executable
</li>
</ul>

<div class="org-src-container">
<label class="org-src-name">Declarations (normally in header files) generate external references to the symbols:</label>
<pre class="src src-c"><span class="org-keyword">extern</span> <span class="org-type">int</span> <span class="org-variable-name">foo</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Generates an external reference to the symbol "foo"</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">Definitions (usually in implementation files) set aside storage for the symbols:</label>
<pre class="src src-c"><span class="org-type">int</span> <span class="org-variable-name">foo</span> = 3;
</pre>
</div>

<ul class="org-ul">
<li>Linker reports "multiply defined" when more than 1 definition is found for a symbol.
</li>
<li>Linker reports "unresolved symbol" when no definition is found for a symbol.
</li>
</ul>

<p>
Linker generates a map file, which is a list of all the symbols in the executable, along with their addresses. This tells what modules were linked in from the library, and the sizes of each module. 
</p>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Own and Refactor the Build</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<span class="underline">The build is an essential part of the development process.</span> It <span class="underline">creates executable artifacts</span> for developers and end users to test and run. It <span class="underline">defines the component architecture</span> of the application. Build scripts are often written in a different language than source code.
</p>

<p>
Testing as we code is necessary to being able to deliver value predictably. In much the same way, the build process needs to be owned by the development team.
</p>

<p>
Automating configuration in the build can enable you to get consistent results when multiple people are working on a project, avoiding an "it works for me" conversation.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Code Analysis</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Automate Coding Standard</h3>
<div class="outline-text-3" id="text-5-1">
<p>
One reason to format the code in a uniform way is so that nobody can "own" a piece of code by formatting it in his private way. 
</p>

<ul class="org-ul">
<li>Make code formatting part of the build process.
</li>
<li>Use static code analysis tools to scan the code for antipatterns.
</li>
<li>Do not only measure test coverage, but automatically check the results. Break the build if test coverage is too low.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Code Analysis Tools</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Most languages, particularly ones branded dynamic, expose their abstract syntax tree and compiler tools as part of their standard library. These often contain hidden gems that are useful for static analysis and dynamic testing.
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Dirty Code Bombs</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Measure and control the degree and depth of coupling and complexity of code. Software metrics can be used to count the occurrences of specific features in code.
</p>

<ul class="org-ul">
<li>Fan-out: the number of classes referenced either directly or indirectly from a class of interest, or the count of all the classes that must be compiled before this class can be compiled.
</li>
<li>Fan-in: the count of all classes that depend upon the class of interest.
</li>
</ul>

<p>
Instability factor: $I = \text{fo} / (\text{fi} + \text{fo})$. As \(I\) approaches 0, the package becomes more stable. The goal in refactoring is to move \(I\) closer to 0.
</p>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Let Your Project Speak for Itself</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Include static code analysis in continuous integration server to gather code metrics. Delegate this task to the project itself and rely on it to report when things get worse.
</p>

<p>
Give your project a voice by email or instant messaging, informing the developers about the latest decline or improvement in numbers. Use extreme feedback device (XFD) to drive a physical device such as a lamp, a toy robot, or even a USB rocket launcher, based on the results of the automatic analysis.
</p>
</div>
</div>
