programming/book/97_things_every_programmer_should_know.org
** Write Small Functions Using Examples

_Tests can demonstrate the presence of features, but tests cannot prove the absence of bugs._ To write code that is correct, and have evidence on hand that it is correct, we need to think about the "size" of a function — the size of the mathematical function that the code manifests.

A mathematical function can be understood as a set, some subset of the Cartesian product of the sets that are its domain (all possible arguments) and range (all possible results).

#+caption: In the game of Go there is a condition called atari in which a player's stones may be captured by opponent: a stone with 2 or more free spaces adjacent to it (called liberties) is not in atari.
#+begin_src c
boolean atari(int libertyCount)
    libertyCount < 2
#+end_src

If argument =int= can have 2^32 = 4,294,976,296 different values, and result =boolean= can have 2 values, then there are 8,589,934,592 members in the Cartesian product of the sets, and half of these belong to the subset which is the function. To provide complete evidence that the function is correct, it will need to check around 4.3E9 examples.

#+caption: The nature of Go means that the number of liberties of a stone is not any =int=, but exactly one of ={1,2,3,4}=. So it can be alternatively wrote:
#+begin_src c
LibertyCount = {1,2,3,4}
boolean atari(LibertyCount libertyCount)
    libertyCount == 1
#+end_src

This is one reason why it's a good idea to _use types closely related to the problem domain to write programs, rather than native types_. Using domain-inspired types can often make the functions much smaller.

* Coding
** Before You Refactor

- Avoid the temptation to rewrite everything. It is best to reuse as much code as possible.
- Many incremental changes are better than one massive change.

Throwing away the old code means throwing away months (or years) of tested, battle-hardened code that may have had certain workarounds and bug fixes you aren't aware of.

That the style or the structure of the code does not meet your personal preference is not a valid reason for restructuring. Thinking you could do a better job than the previous programmer is not a valid reason, either.

New technology is an insufficient reason to refactor. Unless a cost-benefit analysis shows that a new language or framework will result in significant improvements in functionality, maintainability, or productivity, it is best to leave it as it is.

** Beware the Share

The fact that wildly different parts of the system performed some logic in the same way meant less than you thought. Similar code were accidental, a temporal anomaly, a coincidence. They could evolve independently. Each could change its logic to suit the needs of the system's changing business environment.

While the absolute number of lines of code is decreased, the number of dependencies could be increased.

** Code Layout Matters

A research suggests that we spend much more of programming time navigating and reading code — finding where to make the change — than actually typing.

People are good at visual pattern matching. If _code that behaves the same looks the same_, then perceptual system will help pick out the differences.

Line breaks and groupings reflect the intention of the code.

** Coding with Reason

Divide the code into short sections, at each endpoint, the state of the program (namely, the program counter and the values of all objects) satisfies an easily described property, and so that the functionality of that section (state transformation) is easy to describe as a single task.

- Avoid using modifiable global variables.
- Each variable should have the smallest possible scope.
- If you need a nested section, make it a function.
- Grouping related parameters into a single object.
- Each unit of code, from a block to a library, should have a narrow interface.
  + Getters that return internal state are a liability. _Don't ask an object for information to work with. Instead, ask the object to do the work with the information it already has._
  + In order to preserve class invariants, usage of setters should be discouraged.

** Improve Code by Removing It

- Write code because it adds value, not because it amuses you.
- If you don't need it right now, don't write it right now.
- It always takes longer to write and to maintain extra code. A small, extra bit of code snowballs over time into a large piece of work that needs maintenance.

** Know Your Next Commit

Know your next commit. If you cannot finish, throw away your changes, then define a new task you believe in with the insights you have gained. Do speculative experimentation whenever needed, but do not let yourself slip into speculative mode without noticing. Do not commit guesswork into repository.

** Only the Code Tells the Truth

To make code tell the truth as clearly as possible:

- Strive for good names.
- Structure code with respect to cohesive functionality.
- Decouple code to achieve orthogonality.
- Write automated tests explaining the intended behavior and check the interfaces.

** Read Code

Reading other people's code is particularly hard. Not necessarily because other people's code is bad, but because they probably think and solve problems in a different way than you.

Dependency-breaking techniques may be good for low coupling, but they can sometimes also make code harder to read.

* Commenting
** A Comment on Comments

Header comments should give any programmer enough information to use the code without having to read it, while inline comments should assist the next developer in fixing or extending it.

