programming/book/97_things_every_programmer_should_know.html
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> Write Small Functions Using Examples</h3>
<div class="outline-text-3" id="text-5-5">
<p>
<span class="underline">Tests can demonstrate the presence of features, but tests cannot prove the absence of bugs.</span> To write code that is correct, and have evidence on hand that it is correct, we need to think about the "size" of a function — the size of the mathematical function that the code manifests.
</p>

<p>
A mathematical function can be understood as a set, some subset of the Cartesian product of the sets that are its domain (all possible arguments) and range (all possible results).
</p>

<div class="org-src-container">
<label class="org-src-name">In the game of Go there is a condition called atari in which a player's stones may be captured by opponent: a stone with 2 or more free spaces adjacent to it (called liberties) is not in atari.</label>
<pre class="src src-c"><span class="org-type">boolean</span> <span class="org-function-name">atari</span>(<span class="org-type">int</span> <span class="org-variable-name">libertyCount</span>)
    libertyCount &lt; 2
</pre>
</div>

<p>
If argument <code>int</code> can have 2^32 = 4,294,976,296 different values, and result <code>boolean</code> can have 2 values, then there are 8,589,934,592 members in the Cartesian product of the sets, and half of these belong to the subset which is the function. To provide complete evidence that the function is correct, it will need to check around 4.3E9 examples.
</p>

<div class="org-src-container">
<label class="org-src-name">The nature of Go means that the number of liberties of a stone is not any <code>int</code>, but exactly one of <code>{1,2,3,4}</code>. So it can be alternatively wrote:</label>
<pre class="src src-c">LibertyCount = {1,2,3,4}
<span class="org-type">boolean</span> <span class="org-function-name">atari</span>(<span class="org-type">LibertyCount</span> <span class="org-variable-name">libertyCount</span>)
    libertyCount == 1
</pre>
</div>

<p>
This is one reason why it's a good idea to <span class="underline">use types closely related to the problem domain to write programs, rather than native types</span>. Using domain-inspired types can often make the functions much smaller.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Coding</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Before You Refactor</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Avoid the temptation to rewrite everything. It is best to reuse as much code as possible.
</li>
<li>Many incremental changes are better than one massive change.
</li>
</ul>

<p>
Throwing away the old code means throwing away months (or years) of tested, battle-hardened code that may have had certain workarounds and bug fixes you aren't aware of.
</p>

<p>
That the style or the structure of the code does not meet your personal preference is not a valid reason for restructuring. Thinking you could do a better job than the previous programmer is not a valid reason, either.
</p>

<p>
New technology is an insufficient reason to refactor. Unless a cost-benefit analysis shows that a new language or framework will result in significant improvements in functionality, maintainability, or productivity, it is best to leave it as it is.
</p>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Beware the Share</h3>
<div class="outline-text-3" id="text-6-2">
<p>
The fact that wildly different parts of the system performed some logic in the same way meant less than you thought. Similar code were accidental, a temporal anomaly, a coincidence. They could evolve independently. Each could change its logic to suit the needs of the system's changing business environment.
</p>

<p>
While the absolute number of lines of code is decreased, the number of dependencies could be increased.
</p>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Code Layout Matters</h3>
<div class="outline-text-3" id="text-6-3">
<p>
A research suggests that we spend much more of programming time navigating and reading code — finding where to make the change — than actually typing.
</p>

<p>
People are good at visual pattern matching. If <span class="underline">code that behaves the same looks the same</span>, then perceptual system will help pick out the differences.
</p>

<p>
Line breaks and groupings reflect the intention of the code.
</p>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Coding with Reason</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Divide the code into short sections, at each endpoint, the state of the program (namely, the program counter and the values of all objects) satisfies an easily described property, and so that the functionality of that section (state transformation) is easy to describe as a single task.
</p>

<ul class="org-ul">
<li>Avoid using modifiable global variables.
</li>
<li>Each variable should have the smallest possible scope.
</li>
<li>If you need a nested section, make it a function.
</li>
<li>Grouping related parameters into a single object.
</li>
<li>Each unit of code, from a block to a library, should have a narrow interface.
<ul class="org-ul">
<li>Getters that return internal state are a liability. <span class="underline">Don't ask an object for information to work with. Instead, ask the object to do the work with the information it already has.</span>
</li>
<li>In order to preserve class invariants, usage of setters should be discouraged.
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> Improve Code by Removing It</h3>
<div class="outline-text-3" id="text-6-5">
<ul class="org-ul">
<li>Write code because it adds value, not because it amuses you.
</li>
<li>If you don't need it right now, don't write it right now.
</li>
<li>It always takes longer to write and to maintain extra code. A small, extra bit of code snowballs over time into a large piece of work that needs maintenance.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> Know Your Next Commit</h3>
<div class="outline-text-3" id="text-6-6">
<p>
Know your next commit. If you cannot finish, throw away your changes, then define a new task you believe in with the insights you have gained. Do speculative experimentation whenever needed, but do not let yourself slip into speculative mode without noticing. Do not commit guesswork into repository.
</p>
</div>
</div>
<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> Only the Code Tells the Truth</h3>
<div class="outline-text-3" id="text-6-7">
<p>
To make code tell the truth as clearly as possible:
</p>

<ul class="org-ul">
<li>Strive for good names.
</li>
<li>Structure code with respect to cohesive functionality.
</li>
<li>Decouple code to achieve orthogonality.
</li>
<li>Write automated tests explaining the intended behavior and check the interfaces.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> Read Code</h3>
<div class="outline-text-3" id="text-6-8">
<p>
Reading other people's code is particularly hard. Not necessarily because other people's code is bad, but because they probably think and solve problems in a different way than you.
</p>

<p>
Dependency-breaking techniques may be good for low coupling, but they can sometimes also make code harder to read.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Commenting</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> A Comment on Comments</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Header comments should give any programmer enough information to use the code without having to read it, while inline comments should assist the next developer in fixing or extending it.
</p>
</div>
</div>
