programming/book/97_things_every_programmer_should_know.org
** Comment Only What the Code Cannot Say

Comments that parrot the code offer nothing extra to the reader. _Comments should be treated as though they were code._ Each comment should add some value for the reader.

Any shortfall _between what you can express in code and what you would like to express_ in total becomes a plausible candidate for a useful comment.

Version-related comments and commented-out code try to address questions of versioning and history. These questions have already been answered (far more effectively) by version control tools.

A prevalence of noisy comments and incorrect comments in a codebase encourages programmers to ignore all comments.

_Instead of compensating for poor method or class names, rename them. Instead of commenting sections in long functions, extract smaller functions whose names capture the former sections' intent._

* Debugging
** Check Your Code First

Usual debugging advices:

- Isolate the problem, stub out calls, and surround it with tests.
- Check calling conventions, shared libraries, and version numbers.
- Explain it to someone else.
- Look out for stack corruption and variable type mismatches.
- Try the code on different machines and build configurations.

All the recommendations to favor simple code are multiplied when a system is multithreaded. Debugging and unit tests cannot be relied on to find such bugs with any consistency, so simplicity of design is paramount.

** How to Use a Bug Tracker

A good bug report needs to convey:

- How to reproduce the bug.
- What should have happened.
- What actually happened.

** Two Wrongs Can Make a Right

Code never lies, but it can contradict itself.

Consider a function that returns a completion status. Imagine that it returns =false= when it should return =true=. Now imagine that the calling function neglects to check the return value. Everything works fine until one day someone notices the missing check and inserts it.

Consider an application that stores state as an XML document. Imagine that one of the nodes is incorrectly written as =TimeToLive= instead of =TimeToDie=, as the documentation says it should. Everything appears fine while the writer code and the reader code both contain the same error. But fix one, or add a new application reading the same document, and the symmetry is broken.

_When two defects in the code create one visible fault, the methodical approach to fixing faults can itself break down._ When the first defect is fixed, the second defect is at work. So the first fix is removed. The second underlying defect is found, and a fix applied for that. But the first defect has returned. The process repeats.

The problem also exists in written requirements documents. An error in the code compensates for an error in the written description.

Single wrongs can be easy to spot and easy to fix. It is the problems with multiple causes, needing multiple changes, that are harder to resolve. In part, this is because _easy problems are so easily fixed that people tend to fix them relatively quickly and store up the more difficult problems for a later date_.

* Deployment
** Deploy Early and Often

The installation/deployment process is the first thing that the customer sees, and a simple one is the first step to having a reliable (or, at least, easy to debug) production environment.

Starting your project with an installation process. Running and testing the installation process on a clean environment periodically, to check for assumptions in the code that rely on the development or test environments.

** Don't Touch That Code!

In most web-based development environments, the architecture can be broken down:

| *Environment*                           | *Tests*                                  |
|-----------------------------------------+------------------------------------------|
| Local development (developer's machine) | Unit testing                             |
|-----------------------------------------+------------------------------------------|
| Development server                      | Manual or automated integration testings |
|-----------------------------------------+------------------------------------------|
| Staging server                          | Acceptance testings by QA team and users |
|-----------------------------------------+------------------------------------------|
| Production server                       |                                          |

A developer should never have access beyond the development server.

** One Binary

Don't use build to rewrite the code to generate custom settings for each target environment. Hold environment-specific details in the environment (in the component container, in a known file, or in the path).

Keep the environment information versioned. The environmental information should be versioned separately from the code, since they'll change at different rates and for different reasons.

Separate core features with platform-specific features.

* Design Principles
** Don't Repeat Yourself

_Every line of code that goes into an application must be maintained, and is a potential source of future bugs._ Duplication needlessly bloats the codebase, resulting in more opportunities for bugs and adding accidental complexity to the system. DRY requires that _every piece of knowledge must have a single, unambiguous, authoritative representation within a system_.

Wherever painful manual processes exist that can be automated, they should be automated and standardized. The goal is to _ensure that there is only one way of accomplishing the task, and it is as painless as possible_.

Many design patterns have the explicit goal of reducing or eliminating duplication in logic within an application.

- If an object typically requires several things to happen before it can be used, this can be accomplished with an Abstract Factory or a Factory Method pattern.
- If an object has many possible variations in its behavior, these behaviors can be injected using the Strategy pattern rather than large if-then structures.

