programming/book/97_things_every_programmer_should_know.html
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Comment Only What the Code Cannot Say</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Comments that parrot the code offer nothing extra to the reader. <span class="underline">Comments should be treated as though they were code.</span> Each comment should add some value for the reader.
</p>

<p>
Any shortfall <span class="underline">between what you can express in code and what you would like to express</span> in total becomes a plausible candidate for a useful comment.
</p>

<p>
Version-related comments and commented-out code try to address questions of versioning and history. These questions have already been answered (far more effectively) by version control tools.
</p>

<p>
A prevalence of noisy comments and incorrect comments in a codebase encourages programmers to ignore all comments.
</p>

<p>
<span class="underline">Instead of compensating for poor method or class names, rename them. Instead of commenting sections in long functions, extract smaller functions whose names capture the former sections' intent.</span>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Debugging</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Check Your Code First</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Usual debugging advices:
</p>

<ul class="org-ul">
<li>Isolate the problem, stub out calls, and surround it with tests.
</li>
<li>Check calling conventions, shared libraries, and version numbers.
</li>
<li>Explain it to someone else.
</li>
<li>Look out for stack corruption and variable type mismatches.
</li>
<li>Try the code on different machines and build configurations.
</li>
</ul>

<p>
All the recommendations to favor simple code are multiplied when a system is multithreaded. Debugging and unit tests cannot be relied on to find such bugs with any consistency, so simplicity of design is paramount.
</p>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> How to Use a Bug Tracker</h3>
<div class="outline-text-3" id="text-8-2">
<p>
A good bug report needs to convey:
</p>

<ul class="org-ul">
<li>How to reproduce the bug.
</li>
<li>What should have happened.
</li>
<li>What actually happened.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Two Wrongs Can Make a Right</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Code never lies, but it can contradict itself.
</p>

<p>
Consider a function that returns a completion status. Imagine that it returns <code>false</code> when it should return <code>true</code>. Now imagine that the calling function neglects to check the return value. Everything works fine until one day someone notices the missing check and inserts it.
</p>

<p>
Consider an application that stores state as an XML document. Imagine that one of the nodes is incorrectly written as <code>TimeToLive</code> instead of <code>TimeToDie</code>, as the documentation says it should. Everything appears fine while the writer code and the reader code both contain the same error. But fix one, or add a new application reading the same document, and the symmetry is broken.
</p>

<p>
<span class="underline">When two defects in the code create one visible fault, the methodical approach to fixing faults can itself break down.</span> When the first defect is fixed, the second defect is at work. So the first fix is removed. The second underlying defect is found, and a fix applied for that. But the first defect has returned. The process repeats.
</p>

<p>
The problem also exists in written requirements documents. An error in the code compensates for an error in the written description.
</p>

<p>
Single wrongs can be easy to spot and easy to fix. It is the problems with multiple causes, needing multiple changes, that are harder to resolve. In part, this is because <span class="underline">easy problems are so easily fixed that people tend to fix them relatively quickly and store up the more difficult problems for a later date</span>.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Deployment</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Deploy Early and Often</h3>
<div class="outline-text-3" id="text-9-1">
<p>
The installation/deployment process is the first thing that the customer sees, and a simple one is the first step to having a reliable (or, at least, easy to debug) production environment.
</p>

<p>
Starting your project with an installation process. Running and testing the installation process on a clean environment periodically, to check for assumptions in the code that rely on the development or test environments.
</p>
</div>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Don't Touch That Code!</h3>
<div class="outline-text-3" id="text-9-2">
<p>
In most web-based development environments, the architecture can be broken down:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>Environment</b></th>
<th scope="col" class="left"><b>Tests</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Local development (developer's machine)</td>
<td class="left">Unit testing</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Development server</td>
<td class="left">Manual or automated integration testings</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Staging server</td>
<td class="left">Acceptance testings by QA team and users</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Production server</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
A developer should never have access beyond the development server.
</p>
</div>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> One Binary</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Don't use build to rewrite the code to generate custom settings for each target environment. Hold environment-specific details in the environment (in the component container, in a known file, or in the path).
</p>

<p>
Keep the environment information versioned. The environmental information should be versioned separately from the code, since they'll change at different rates and for different reasons.
</p>

<p>
Separate core features with platform-specific features.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Design Principles</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Don't Repeat Yourself</h3>
<div class="outline-text-3" id="text-10-1">
<p>
<span class="underline">Every line of code that goes into an application must be maintained, and is a potential source of future bugs.</span> Duplication needlessly bloats the codebase, resulting in more opportunities for bugs and adding accidental complexity to the system. DRY requires that <span class="underline">every piece of knowledge must have a single, unambiguous, authoritative representation within a system</span>.
</p>

<p>
Wherever painful manual processes exist that can be automated, they should be automated and standardized. The goal is to <span class="underline">ensure that there is only one way of accomplishing the task, and it is as painless as possible</span>.
</p>

<p>
Many design patterns have the explicit goal of reducing or eliminating duplication in logic within an application.
</p>

<ul class="org-ul">
<li>If an object typically requires several things to happen before it can be used, this can be accomplished with an Abstract Factory or a Factory Method pattern.
</li>
<li>If an object has many possible variations in its behavior, these behaviors can be injected using the Strategy pattern rather than large if-then structures.
</li>
</ul>
</div>
</div>
