programming/book/97_things_every_programmer_should_know.org
** The Single Responsibility Principle

One foundational principle of good design, known as the _Single Responsibility Principle, or SRP: Gather together those things that change for the same reason, and separate those things that change for different reasons._ A subsystem, module, class, or even a function, should not have more than one reason to change.

#+begin_src java
public class Employee { // Any class depending on Employee will be affected by changes below
    public Money calculatePay() {} // Changes when rules for calculating pay change
    public String reportHours() {} // Changes when a different format of report is needed
    public void save() {}          // Changes when database schema changes
}
#+end_src

Good system design means _separating the system into components that can be independently deployed_. Component design (or +SOA+, if you prefer the trendier name) means when one component is changed, we do not have to redeploy any of the others.

#+begin_src java
public class Employee {
    public Money calculatePay() {}
}
public class EmployeeReporter {
    public String reportHours(Employee e) {}
}
public class EmployeeRepository {
    public void save(Employee e) {}
}
#+end_src

** Thinking in States

+Design by Contract (DbC)+: ensure a valid state by validating incoming data and the object itself on entry and exit of each public method.

* Design Patterns
** The Singleton Pattern

The single-instance requirement is often imagined. In many cases, it's pure speculation that no additional instances will be needed in the future. _Requirements will change. Good design embraces this._ Singletons don't.

Singletons cause implicit dependencies between conceptually independent units of code.

Singletons also carry implicit persistent state, which hinders unit testing. Unit testing depends on tests being independent of one another, so the tests can be run in any order and the program can be set to a known state before the execution of every unit test. Once singletons with mutable state are introduced, this may be hard to achieve. Such globally accessible persistent state makes it harder to reason about the code, especially in a multithreaded environment.

The cleanup of singletons may present a final challenge. There is no support for explicitly killing singletons. There is no order to the implicit cleanup of singletons at program exit. This can be troublesome for applications that contain singletons with interdependencies.

- Restrict use of the Singleton pattern to the classes that truly must never be instantiated more than once.
- Don't use a singleton's global access point from arbitrary code. Instead, direct access to the singleton should come from only a few well-defined places, from where it can be passed around via an interface. User code of the interface does not depend on whether a singleton or any other kind of class implements the interface.

* Domains
** Code in the Language of the Domain

#+begin_src java
// Algorithmic approach
if (portfolioIdsByTraderId.get(trader.getId()).containsKey(portfolio.getId())) { ... }
// Business concept approach
if (trader.canView(portfolio)) { ... }
#+end_src

"Computer science" was about spending effort mapping the real world into the restrictive data structures.

Making domain concepts explicit in the code means other programmers can gather the intent of the code much more easily than by trying to retrofit an algorithm into what they understand about a domain.

Coupled with good encapsulation, the chances are good that the rule will exist in only one place. When the domain model evolves, you are in a good position to evolve the code.

** Prefer Domain-Specific Types

On September 23, 1999, the $327.6 million Mars Climate Orbiter was lost while entering orbit around Mars due to a software error back on Earth. The error was later called the metric mix-up. The ground-station software was working in pounds, while the spacecraft expected newtons, leading the ground station to underestimate the power of the spacecraft’s thrusters by a factor of 4.45.

One of Ada language's primary design goals was to implement embedded safety-critical software. Ada has strong typing with static checking for both primitive types and user-defined types.

In other languages, domain-specific typing can be applied by using classes instead primitive types:

- The code becomes more readable, as it expresses concepts of a domain.
- The code becomes more testable, as the code encapsulates behavior.
- The code facilitates reuse.

Developers using statically typed languages get some help from the compiler, while those embracing dynamically typed languages are more likely to rely on their unit tests.

* Errors
