programming/book/97_things_every_programmer_should_know.html
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> The Single Responsibility Principle</h3>
<div class="outline-text-3" id="text-10-2">
<p>
One foundational principle of good design, known as the <span class="underline">Single Responsibility Principle, or SRP: Gather together those things that change for the same reason, and separate those things that change for different reasons.</span> A subsystem, module, class, or even a function, should not have more than one reason to change.
</p>

<div class="org-src-container">

<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Employee</span> { <span class="org-comment-delimiter">// </span><span class="org-comment">Any class depending on Employee will be affected by changes below</span>
    <span class="org-keyword">public</span> <span class="org-type">Money</span> <span class="org-function-name">calculatePay</span>() {} <span class="org-comment-delimiter">// </span><span class="org-comment">Changes when rules for calculating pay change</span>
    <span class="org-keyword">public</span> <span class="org-type">String</span> <span class="org-function-name">reportHours</span>() {} <span class="org-comment-delimiter">// </span><span class="org-comment">Changes when a different format of report is needed</span>
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">save</span>() {}          <span class="org-comment-delimiter">// </span><span class="org-comment">Changes when database schema changes</span>
}
</pre>
</div>

<p>
Good system design means <span class="underline">separating the system into components that can be independently deployed</span>. Component design (or <del>SOA</del>, if you prefer the trendier name) means when one component is changed, we do not have to redeploy any of the others.
</p>

<div class="org-src-container">

<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Employee</span> {
    <span class="org-keyword">public</span> <span class="org-type">Money</span> <span class="org-function-name">calculatePay</span>() {}
}
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">EmployeeReporter</span> {
    <span class="org-keyword">public</span> <span class="org-type">String</span> <span class="org-function-name">reportHours</span>(<span class="org-type">Employee</span> <span class="org-variable-name">e</span>) {}
}
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">EmployeeRepository</span> {
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">save</span>(<span class="org-type">Employee</span> <span class="org-variable-name">e</span>) {}
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> Thinking in States</h3>
<div class="outline-text-3" id="text-10-3">
<p>
<del>Design by Contract (DbC)</del>: ensure a valid state by validating incoming data and the object itself on entry and exit of each public method.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Design Patterns</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> The Singleton Pattern</h3>
<div class="outline-text-3" id="text-11-1">
<p>
The single-instance requirement is often imagined. In many cases, it's pure speculation that no additional instances will be needed in the future. <span class="underline">Requirements will change. Good design embraces this.</span> Singletons don't.
</p>

<p>
Singletons cause implicit dependencies between conceptually independent units of code.
</p>

<p>
Singletons also carry implicit persistent state, which hinders unit testing. Unit testing depends on tests being independent of one another, so the tests can be run in any order and the program can be set to a known state before the execution of every unit test. Once singletons with mutable state are introduced, this may be hard to achieve. Such globally accessible persistent state makes it harder to reason about the code, especially in a multithreaded environment.
</p>

<p>
The cleanup of singletons may present a final challenge. There is no support for explicitly killing singletons. There is no order to the implicit cleanup of singletons at program exit. This can be troublesome for applications that contain singletons with interdependencies.
</p>

<ul class="org-ul">
<li>Restrict use of the Singleton pattern to the classes that truly must never be instantiated more than once.
</li>
<li>Don't use a singleton's global access point from arbitrary code. Instead, direct access to the singleton should come from only a few well-defined places, from where it can be passed around via an interface. User code of the interface does not depend on whether a singleton or any other kind of class implements the interface.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Domains</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> Code in the Language of the Domain</h3>
<div class="outline-text-3" id="text-12-1">
<div class="org-src-container">

<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Algorithmic approach</span>
<span class="org-keyword">if</span> (portfolioIdsByTraderId.get(trader.getId()).containsKey(portfolio.getId())) { ... }
<span class="org-comment-delimiter">// </span><span class="org-comment">Business concept approach</span>
<span class="org-keyword">if</span> (trader.canView(portfolio)) { ... }
</pre>
</div>

<p>
"Computer science" was about spending effort mapping the real world into the restrictive data structures.
</p>

<p>
Making domain concepts explicit in the code means other programmers can gather the intent of the code much more easily than by trying to retrofit an algorithm into what they understand about a domain.
</p>

<p>
Coupled with good encapsulation, the chances are good that the rule will exist in only one place. When the domain model evolves, you are in a good position to evolve the code.
</p>
</div>
</div>
<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> Prefer Domain-Specific Types</h3>
<div class="outline-text-3" id="text-12-2">
<p>
On September 23, 1999, the $327.6 million Mars Climate Orbiter was lost while entering orbit around Mars due to a software error back on Earth. The error was later called the metric mix-up. The ground-station software was working in pounds, while the spacecraft expected newtons, leading the ground station to underestimate the power of the spacecraft’s thrusters by a factor of 4.45.
</p>

<p>
One of Ada language's primary design goals was to implement embedded safety-critical software. Ada has strong typing with static checking for both primitive types and user-defined types.
</p>

<p>
In other languages, domain-specific typing can be applied by using classes instead primitive types:
</p>

<ul class="org-ul">
<li>The code becomes more readable, as it expresses concepts of a domain.
</li>
<li>The code becomes more testable, as the code encapsulates behavior.
</li>
<li>The code facilitates reuse.
</li>
</ul>

<p>
Developers using statically typed languages get some help from the compiler, while those embracing dynamically typed languages are more likely to rely on their unit tests.
</p>
</div>
</div>
</div>
