programming/book/97_things_every_programmer_should_know.org
** Business Exceptions

There are basically two reasons that things go wrong at runtime:

- Technical problems that prevent us from using the application.
- Business logic that prevents us from misusing the application.

It is a potential source of confusion to represent them both using the same exception hierarchy. Separating the cases gives clarity and increases the chances that technical exceptions will be handled by some application framework, while the business domain exceptions actually are considered and handled by the client code.

An unresolvable technical problem can occur when there is a programming error. Let the exception bubble up to the highest architectural level and let some general exception-handling mechanism do what it can to ensure that the system is in a safe state, such as rolling back a transaction, logging and alerting administration, and reporting back (politely) to the user.

An exception: the situation where you cannot complete the call for a domain-logical reason. Unusual and undesirable, but not bizarre or programmatically in error. Throwing an exception is just an alternative return path that is part of the model and that the client should be aware of and be prepared to handle. It is appropriate to create a specific exception or a separate exception hierarchy so that the client can handle the situation on its own terms.

** Don't Ignore That Error!

- Return codes can be used as the resulting value of a function to mean "it didn't work".
- Exceptions are a more structured language-supported way of signaling and handling errors.
- Deal with problems at the earliest opportunity.
- Check all potential errors in the code, and expose all potentially erroneous conditions in the interfaces.

** Prevent Errors

Cues are different from instructions: cues tend to be hints; instructions are verbose. Cues occur at the point of interaction; instructions appear before the point of interaction.

_Instructions are ineffective at preventing error. Users tend to assume that interfaces will work in line with their past experience._

** Verbose Logging

Too much logging can be as useless as none at all. Make sure from day one that if something is logged in the error log, you're willing to have someone call and wake you in the middle of the night about it.

Simulate load on the system during system testing, looking at a noise-free error log is also a good first indication that the system is reasonably robust.

* Learning
** Continuous Learning

- A good way to learn something is to teach or speak about it.
- Join or start a study group or a local user group for a language, technology.
- Learn a new language every year. At least learn a new technology or tool.
- Learn how to be more productive.

** Deliberate Practice

Do deliberate practice to improve your ability. Perform the task with the aim of increasing your mastery. Challeng yourself with a task that is just beyond your current ability, trying it, analyzing your performance while and after doing it, and correcting any mistakes.

Greatness is largely a matter of conscious choice. You have to have a minimum amount of natural ability to get started in a sport or profession. After that, the people who excel are the ones who work the hardest.

** Hard Work Does Not Pay Off

Programming and software development as a whole involve a continuous learning process. You always need to learn more about software development in general and programming techniques in particular. Keep yourself updated in your field of expertise.

_Most software projects are more like a long orienteering marathon. In the dark. With only a sketchy map as guidance._ You need to keep a sustainable pace, and you need to adjust the course when you learn more about where you are and where you are heading.

Act like a professional: prepare, effect, observe, reflect, and change.

** Know More Programming Languages

Programming expertise is related directly to the number of different programming paradigms that a programmer is comfortable with, that he can genuinely program with.

It generally takes a good few months of use, even if part-time, to gain a proper working knowledge of a language. It is the idioms of use, not just the syntax and computational model, that are the important factors.

** Reinvent the Wheel Often

More often than not, existing code is working code. It has already gone through some sort of quality control and rigorous testing, and is being used successfully.

The same way that watching a movie about sailing is very different from going sailing, so too is using existing code versus designing your own software from the ground up, testing it, breaking it, repairing it, and improving it along the way.

There are lessons learned from trial and error that have an emotional component to them that reading a technical book alone just cannot deliver. Becoming a great programmer is as much about acquiring experience as it is about collecting facts.

* OOP
** Encapsulate Behavior and State

_An object encapsulates both state and behavior, where the behavior is defined by the actual state._

Less experienced object-oriented developers might decide to wrap all the business rules into an object very often referred to as =OrderManager= or =OrderService=. In these designs, =Order=, =Customer=, and =Item= are treated as little more than record types. All logic is factored out of the classes and tied together in one large, procedural method with a lot of internal =if-then-else= constructs. These methods are easily broken and are almost impossible to maintain. The reason? The encapsulation is broken.

** Polymorphism

Polymorphism, taken from Greek, means many (poly) forms (morph).

Used carefully, _polymorphism creates tiny localized execution contexts that eliminate the need for verbose =if-then-else= blocks._ While there are cases where it's much more practical to use =if-then-else= instead of polymorphism, it is more often the case that a more _polymorphic coding style will yield a smaller, more readable and less fragile codebase_.

* Performance
