programming/book/97_things_every_programmer_should_know.html
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Errors</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> Business Exceptions</h3>
<div class="outline-text-3" id="text-13-1">
<p>
There are basically two reasons that things go wrong at runtime:
</p>

<ul class="org-ul">
<li>Technical problems that prevent us from using the application.
</li>
<li>Business logic that prevents us from misusing the application.
</li>
</ul>

<p>
It is a potential source of confusion to represent them both using the same exception hierarchy. Separating the cases gives clarity and increases the chances that technical exceptions will be handled by some application framework, while the business domain exceptions actually are considered and handled by the client code.
</p>

<p>
An unresolvable technical problem can occur when there is a programming error. Let the exception bubble up to the highest architectural level and let some general exception-handling mechanism do what it can to ensure that the system is in a safe state, such as rolling back a transaction, logging and alerting administration, and reporting back (politely) to the user.
</p>

<p>
An exception: the situation where you cannot complete the call for a domain-logical reason. Unusual and undesirable, but not bizarre or programmatically in error. Throwing an exception is just an alternative return path that is part of the model and that the client should be aware of and be prepared to handle. It is appropriate to create a specific exception or a separate exception hierarchy so that the client can handle the situation on its own terms.
</p>
</div>
</div>
<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> Don't Ignore That Error!</h3>
<div class="outline-text-3" id="text-13-2">
<ul class="org-ul">
<li>Return codes can be used as the resulting value of a function to mean "it didn't work".
</li>
<li>Exceptions are a more structured language-supported way of signaling and handling errors.
</li>
<li>Deal with problems at the earliest opportunity.
</li>
<li>Check all potential errors in the code, and expose all potentially erroneous conditions in the interfaces.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> Prevent Errors</h3>
<div class="outline-text-3" id="text-13-3">
<p>
Cues are different from instructions: cues tend to be hints; instructions are verbose. Cues occur at the point of interaction; instructions appear before the point of interaction.
</p>

<p>
<span class="underline">Instructions are ineffective at preventing error. Users tend to assume that interfaces will work in line with their past experience.</span>
</p>
</div>
</div>
<div id="outline-container-sec-13-4" class="outline-3">
<h3 id="sec-13-4"><span class="section-number-3">13.4</span> Verbose Logging</h3>
<div class="outline-text-3" id="text-13-4">
<p>
Too much logging can be as useless as none at all. Make sure from day one that if something is logged in the error log, you're willing to have someone call and wake you in the middle of the night about it.
</p>

<p>
Simulate load on the system during system testing, looking at a noise-free error log is also a good first indication that the system is reasonably robust.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Learning</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> Continuous Learning</h3>
<div class="outline-text-3" id="text-14-1">
<ul class="org-ul">
<li>A good way to learn something is to teach or speak about it.
</li>
<li>Join or start a study group or a local user group for a language, technology.
</li>
<li>Learn a new language every year. At least learn a new technology or tool.
</li>
<li>Learn how to be more productive.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2"><span class="section-number-3">14.2</span> Deliberate Practice</h3>
<div class="outline-text-3" id="text-14-2">
<p>
Do deliberate practice to improve your ability. Perform the task with the aim of increasing your mastery. Challeng yourself with a task that is just beyond your current ability, trying it, analyzing your performance while and after doing it, and correcting any mistakes.
</p>

<p>
Greatness is largely a matter of conscious choice. You have to have a minimum amount of natural ability to get started in a sport or profession. After that, the people who excel are the ones who work the hardest.
</p>
</div>
</div>
<div id="outline-container-sec-14-3" class="outline-3">
<h3 id="sec-14-3"><span class="section-number-3">14.3</span> Hard Work Does Not Pay Off</h3>
<div class="outline-text-3" id="text-14-3">
<p>
Programming and software development as a whole involve a continuous learning process. You always need to learn more about software development in general and programming techniques in particular. Keep yourself updated in your field of expertise.
</p>

<p>
<span class="underline">Most software projects are more like a long orienteering marathon. In the dark. With only a sketchy map as guidance.</span> You need to keep a sustainable pace, and you need to adjust the course when you learn more about where you are and where you are heading.
</p>

<p>
Act like a professional: prepare, effect, observe, reflect, and change.
</p>
</div>
</div>
<div id="outline-container-sec-14-4" class="outline-3">
<h3 id="sec-14-4"><span class="section-number-3">14.4</span> Know More Programming Languages</h3>
<div class="outline-text-3" id="text-14-4">
<p>
Programming expertise is related directly to the number of different programming paradigms that a programmer is comfortable with, that he can genuinely program with.
</p>

<p>
It generally takes a good few months of use, even if part-time, to gain a proper working knowledge of a language. It is the idioms of use, not just the syntax and computational model, that are the important factors.
</p>
</div>
</div>
<div id="outline-container-sec-14-5" class="outline-3">
<h3 id="sec-14-5"><span class="section-number-3">14.5</span> Reinvent the Wheel Often</h3>
<div class="outline-text-3" id="text-14-5">
<p>
More often than not, existing code is working code. It has already gone through some sort of quality control and rigorous testing, and is being used successfully.
</p>

<p>
The same way that watching a movie about sailing is very different from going sailing, so too is using existing code versus designing your own software from the ground up, testing it, breaking it, repairing it, and improving it along the way.
</p>

<p>
There are lessons learned from trial and error that have an emotional component to them that reading a technical book alone just cannot deliver. Becoming a great programmer is as much about acquiring experience as it is about collecting facts.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> OOP</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> Encapsulate Behavior and State</h3>
<div class="outline-text-3" id="text-15-1">
<p>
<span class="underline">An object encapsulates both state and behavior, where the behavior is defined by the actual state.</span>
</p>

<p>
Less experienced object-oriented developers might decide to wrap all the business rules into an object very often referred to as <code>OrderManager</code> or <code>OrderService</code>. In these designs, <code>Order</code>, <code>Customer</code>, and <code>Item</code> are treated as little more than record types. All logic is factored out of the classes and tied together in one large, procedural method with a lot of internal <code>if-then-else</code> constructs. These methods are easily broken and are almost impossible to maintain. The reason? The encapsulation is broken.
</p>
</div>
</div>
<div id="outline-container-sec-15-2" class="outline-3">
<h3 id="sec-15-2"><span class="section-number-3">15.2</span> Polymorphism</h3>
<div class="outline-text-3" id="text-15-2">
<p>
Polymorphism, taken from Greek, means many (poly) forms (morph).
</p>

<p>
Used carefully, <span class="underline">polymorphism creates tiny localized execution contexts that eliminate the need for verbose <code>if-then-else</code> blocks.</span> While there are cases where it's much more practical to use <code>if-then-else</code> instead of polymorphism, it is more often the case that a more <span class="underline">polymorphic coding style will yield a smaller, more readable and less fragile codebase</span>.
</p>
</div>
</div>
</div>
