programming/book/97_things_every_programmer_should_know.org
** Interprocess Communication

Much performance management literature still focuses on data structures and algorithms, issues that can make a difference in some cases but are far less likely to dominate performance in modern multitier enterprise applications. In such applications, response time depends most strongly on the number of remote interprocess communications (IPCs) conducted in response to a stimulus.

Strategies for reducing the number of remote IPCs:

- Optimize the interface between processes so that exactly the right data is exchanged with the minimum amount of interaction.
- Parallelize the IPCs, so that the overall response time becomes driven mainly by the longest-latency IPC.
- Cache the results of previous IPCs.

** Know Your Limits

Know the space and time complexity of data structures and algorithms, and the architecture and performance characteristics of the systems. Your job is to create an optimal marriage of software and systems.

For achievable $n$, all complexity classes amount to near-constant, near-linear, or near-infinite.

Modern computer systems are organized as hierarchies of physical and virtual machines, including language runtimes, operating systems, CPUs, cache memory, random-access memory, disk drives, and networks.

#+caption: _Random access time and storage capacity for a typical networked server:_
|          | *Access time* | *Capacity* |
|----------+---------------+------------|
| Register | < 1 ns        | 64 b       |
|----------+---------------+------------|
| L1 cache | 1 ns          | 64 KB      |
|----------+---------------+------------|
| L2 cache | 4 ns          | 8 MB       |
|----------+---------------+------------|
| RAM      | 20 ns         | 32 GB      |
|----------+---------------+------------|
| Disk     | 10 ms         | 10 TB      |
|----------+---------------+------------|
| LAN      | 20 ms         | > 1 PB     |
|----------+---------------+------------|
| Internet | 100 ms        | > 1 ZB     |

Caching and lookahead are used heavily at every level of the systems to hide this variation, but they only work when access is predictable. When cache misses are frequent, the system will be thrashing. Reaccessing recently used items and accessing items sequentially are usually a win.

Random access is not predictable. To randomly inspect every byte on a hard drive could take 32 years. Even to randomly inspect every byte in RAM could take 11 minutes.

Algorithms and data structures vary in how effectively they use caches:

- Linear search makes good use of lookahead, but requires $O(n)$ comparisons. Linear search is competitive for small arrays, but loses exponentially for larger arrays.
- Binary search of a sorted array requires only $O(\log{n})$ comparisons.
- Search of a van Emde Boas tree is $O(\log{n})$ and cache-oblivious. van Emde Boas tree is fastest for searching, thanks to its predictable access pattern.

#+caption: Time (ns) required to search arrays of 64-bit integers:
|       | *Linear* | *Binary* | *vEB* |
|-------+----------+----------+-------|
|     8 | 50       | 90       | 40    |
|-------+----------+----------+-------|
|    64 | 180      | 150      | 70    |
|-------+----------+----------+-------|
|   512 | 1,200    | 230      | 100   |
|-------+----------+----------+-------|
| 4,096 | 17,000   | 320      | 160   |

* Practice
** Don't Rely on "Magic Happens Here"

If you look at any activity, process, or discipline from far enough away, it looks simple. When you aren't actively involved in things, there is an unconscious tendency to assume that they are simple and happen "by magic". You don't have to understand all the magic that makes the project work, but make sure that when the magic stops, it can be started again.

** Learn to Estimate

- An estimate is a factual measure based on hard data and previous experience. An estimate cannot be precise.
- A target is a statement of a desirable business objective.
- A commitment is a promise to deliver specified functionality at a certain level of quality by a certain date or event.

Estimates, targets, and commitments are independent from one another, but targets and commitments should be based on sound estimates. The primary purpose of software estimation is not to predict a project's outcome; it is to determine whether a project's targets are realistic enough to allow the project to be controlled to meet them.

** Make the Invisible More Visible

Lack of visible progress is synonymous with lack of progress. Invisibility can be dangerous. You think more clearly when you have something concrete to tie your thinking to. You manage things better when you can see them and see them constantly changing.

- Unit tests help reveal the presence (or absence) of developmental qualities you'd like the code to exhibit, such as low coupling and high cohesion.
- Using bulletin boards and cards makes progress visible and concrete.

It's best to develop software with plenty of regular visible evidence. Visibility gives confidence that progress is genuine and not an illusion, deliberate and not unintentional, repeatable and not accidental.

** The Boy Scout Rule

Try and leave this world a little better than you found it.

* Quality
** Code Is Design

Some life-or-death projects will be more diligent, but in many cases, companies can always patch the broken buildings and vehicles they sell. And it points to a startlingly counterintuitive conclusion: our sole premise was a dramatic reduction in construction costs, with the result that quality got worse. If we accept that code is design — a creative process rather than a mechanical one — the software crisis is explained.

* Teamwork
