programming/book/97_things_every_programmer_should_know.html
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Performance</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> Interprocess Communication</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Much performance management literature still focuses on data structures and algorithms, issues that can make a difference in some cases but are far less likely to dominate performance in modern multitier enterprise applications. In such applications, response time depends most strongly on the number of remote interprocess communications (IPCs) conducted in response to a stimulus.
</p>

<p>
Strategies for reducing the number of remote IPCs:
</p>

<ul class="org-ul">
<li>Optimize the interface between processes so that exactly the right data is exchanged with the minimum amount of interaction.
</li>
<li>Parallelize the IPCs, so that the overall response time becomes driven mainly by the longest-latency IPC.
</li>
<li>Cache the results of previous IPCs.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-16-2" class="outline-3">
<h3 id="sec-16-2"><span class="section-number-3">16.2</span> Know Your Limits</h3>
<div class="outline-text-3" id="text-16-2">
<p>
Know the space and time complexity of data structures and algorithms, and the architecture and performance characteristics of the systems. Your job is to create an optimal marriage of software and systems.
</p>

<p>
For achievable \(n\), all complexity classes amount to near-constant, near-linear, or near-infinite.
</p>

<p>
Modern computer systems are organized as hierarchies of physical and virtual machines, including language runtimes, operating systems, CPUs, cache memory, random-access memory, disk drives, and networks.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> <span class="underline">Random access time and storage capacity for a typical networked server:</span></caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left"><b>Access time</b></th>
<th scope="col" class="left"><b>Capacity</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Register</td>
<td class="left">&lt; 1 ns</td>
<td class="left">64 b</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">L1 cache</td>
<td class="left">1 ns</td>
<td class="left">64 KB</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">L2 cache</td>
<td class="left">4 ns</td>
<td class="left">8 MB</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">RAM</td>
<td class="left">20 ns</td>
<td class="left">32 GB</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Disk</td>
<td class="left">10 ms</td>
<td class="left">10 TB</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">LAN</td>
<td class="left">20 ms</td>
<td class="left">&gt; 1 PB</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Internet</td>
<td class="left">100 ms</td>
<td class="left">&gt; 1 ZB</td>
</tr>
</tbody>
</table>

<p>
Caching and lookahead are used heavily at every level of the systems to hide this variation, but they only work when access is predictable. When cache misses are frequent, the system will be thrashing. Reaccessing recently used items and accessing items sequentially are usually a win.
</p>

<p>
Random access is not predictable. To randomly inspect every byte on a hard drive could take 32 years. Even to randomly inspect every byte in RAM could take 11 minutes.
</p>

<p>
Algorithms and data structures vary in how effectively they use caches:
</p>

<ul class="org-ul">
<li>Linear search makes good use of lookahead, but requires $O(n)$ comparisons. Linear search is competitive for small arrays, but loses exponentially for larger arrays.
</li>
<li>Binary search of a sorted array requires only $O(\log{n})$ comparisons.
</li>
<li>Search of a van Emde Boas tree is $O(\log{n})$ and cache-oblivious. van Emde Boas tree is fastest for searching, thanks to its predictable access pattern.
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Time (ns) required to search arrays of 64-bit integers:</caption>

<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left"><b>Linear</b></th>
<th scope="col" class="right"><b>Binary</b></th>
<th scope="col" class="right"><b>vEB</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">8</td>
<td class="left">50</td>
<td class="right">90</td>
<td class="right">40</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">64</td>
<td class="left">180</td>
<td class="right">150</td>
<td class="right">70</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">512</td>
<td class="left">1,200</td>
<td class="right">230</td>
<td class="right">100</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">4,096</td>
<td class="left">17,000</td>
<td class="right">320</td>
<td class="right">160</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> Practice</h2>
<div class="outline-text-2" id="text-17">
</div><div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><span class="section-number-3">17.1</span> Don't Rely on "Magic Happens Here"</h3>
<div class="outline-text-3" id="text-17-1">
<p>
If you look at any activity, process, or discipline from far enough away, it looks simple. When you aren't actively involved in things, there is an unconscious tendency to assume that they are simple and happen "by magic". You don't have to understand all the magic that makes the project work, but make sure that when the magic stops, it can be started again.
</p>
</div>
</div>
<div id="outline-container-sec-17-2" class="outline-3">
<h3 id="sec-17-2"><span class="section-number-3">17.2</span> Learn to Estimate</h3>
<div class="outline-text-3" id="text-17-2">
<ul class="org-ul">
<li>An estimate is a factual measure based on hard data and previous experience. An estimate cannot be precise.
</li>
<li>A target is a statement of a desirable business objective.
</li>
<li>A commitment is a promise to deliver specified functionality at a certain level of quality by a certain date or event.
</li>
</ul>

<p>
Estimates, targets, and commitments are independent from one another, but targets and commitments should be based on sound estimates. The primary purpose of software estimation is not to predict a project's outcome; it is to determine whether a project's targets are realistic enough to allow the project to be controlled to meet them.
</p>
</div>
</div>
<div id="outline-container-sec-17-3" class="outline-3">
<h3 id="sec-17-3"><span class="section-number-3">17.3</span> Make the Invisible More Visible</h3>
<div class="outline-text-3" id="text-17-3">
<p>
Lack of visible progress is synonymous with lack of progress. Invisibility can be dangerous. You think more clearly when you have something concrete to tie your thinking to. You manage things better when you can see them and see them constantly changing.
</p>

<ul class="org-ul">
<li>Unit tests help reveal the presence (or absence) of developmental qualities you'd like the code to exhibit, such as low coupling and high cohesion.
</li>
<li>Using bulletin boards and cards makes progress visible and concrete.
</li>
</ul>

<p>
It's best to develop software with plenty of regular visible evidence. Visibility gives confidence that progress is genuine and not an illusion, deliberate and not unintentional, repeatable and not accidental.
</p>
</div>
</div>
<div id="outline-container-sec-17-4" class="outline-3">
<h3 id="sec-17-4"><span class="section-number-3">17.4</span> The Boy Scout Rule</h3>
<div class="outline-text-3" id="text-17-4">
<p>
Try and leave this world a little better than you found it.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> Quality</h2>
<div class="outline-text-2" id="text-18">
</div><div id="outline-container-sec-18-1" class="outline-3">
<h3 id="sec-18-1"><span class="section-number-3">18.1</span> Code Is Design</h3>
<div class="outline-text-3" id="text-18-1">
<p>
Some life-or-death projects will be more diligent, but in many cases, companies can always patch the broken buildings and vehicles they sell. And it points to a startlingly counterintuitive conclusion: our sole premise was a dramatic reduction in construction costs, with the result that quality got worse. If we accept that code is design — a creative process rather than a mechanical one — the software crisis is explained.
</p>
</div>
</div>
</div>
