programming/book/97_things_every_programmer_should_know.org
** Code Reviews

Instead of simply correcting mistakes in code, _the purpose of code reviews should be to share knowledge and establish common coding guidelines_. Sharing code with other programmers _enables collective code ownership_.

Introduce different roles for the review meeting, having one reviewer focus on documentation, another on exceptions, and a third to look at the functionality.

Code reviews will flow more easily if the team has coding conventions that are checked by tools.

** Pair Program

As a team, introduce pair programming to promote distribution of skills and knowledge.

Truck factor: how many team members would have to be hit by a truck before the team became unable to complete the final deliverable? In other words, how dependent is the delivery on certain team members? Is knowledge privileged or shared?

** Start from Yes

Starting from yes means working with your colleagues, not against them.

** Two Heads Are Better Than One

Lottery risk: one of your expert developers wins the lottery and
quits the next day.

* Testing
** Test for Required Behavior

Tests need to state contractual obligations rather than parrot implementations. They need to take a blackbox view of the units under test.

** Testing Is the Engineering Rigor of Software Development

Over the past few thousand years, engineers have developed mathematics and physics they can use for a structural solution without having to build it to see what it does. We don't have anything like that in software, and perhaps never will because software is in fact very different. the
building process in software is ridiculously cheap. We’ve developed an entire ecosystem of tools that make it easy to do just that: unit testing, mock objects, test harnesses.

** Test Precisely and Concretely

There are two ways of constructing a software design: one way is to make it so simple that there are obviously no deficiencies and the other is to make it so complicated that there are no obvious deficiencies.

** Test While You Sleep

More often than not, the test servers are idling overnight and over the weekend. You can use this to your advantage. Break down large test suite into two or more profiles:

- A smaller, mandatory test profile that is quick to run will help to ensure that tests are run before each commit.
- Other test profiles can be automated to run overnight, ready to report their results in the morning.

Longer-running tests, or soak tests, are vital for identifying memory leaks and other stability issues.

** When Programmers and Testers Collaborate

- Less time spent sending bugs back and forth through the defect tracking system.
- Less time wasted trying to figure out whether something is a bug or a new feature.

Acceptance Test-Driven Development (ATDD): Testers write and automate acceptance tests using the language of their domain with tools such as Fit (Framework for Integrated Test), and give to the programmers before the coding begins. Programmers write the fixtures to run the tests, and then code to make the tests pass. Defects are prevented because the tests clarify many of the initial ideas. These tests then become part of the regression suite.

When testers stop thinking that their only job is to break the software and find bugs in the programmers' code, programmers stop thinking that testers are "out to get them", and are more open to collaboration.

** Write Tests for People

Good tests act as documentation for the code they are testing. They describe how the code works.

- Describe the context, starting point, or preconditions.
- Illustrate how the software is invoked.
- Describe the expected results or postconditions.

* Tools
** Command-Line Tools

Typically, when a tool is easy to use, it's because the tool is making decisions for you and doing a lot of things automatically, behind the scenes.

Command-line tools inherently support scripting, which allows for the automation of tasks such as producing scheduled daily builds, creating multiple versions of a project, and running test suites.

** Step Back and Automate

- Automate repetitive tasks: version control, compiling, building JAR files, documentation generation, deployment, and reporting.
- Modern IDEs have thousands of potential settings, and it is essentially impossible to ensure that all team members have identical configurations. Build automation systems such as Ant or Autotools give control and repeatability.
- Do it early in a project when time is usually easier to find.

** Unix Tools

Unix tools were developed in an age when a multiuser computer had 128KB
of RAM. The ingenuity that went into their design means that nowadays they can handle huge data sets extremely efficiently.

Most tools work like filters, processing just a single line at the time, meaning that there is no upper limit in the amount of data they can handle.

Unix commands executing as pipelines, which naturally distribute their load among the many processing units of modern multicore CPUs.

** Version Control

Put everything in your project under version control.

- Tag release with a symbolic name to easily revisit in the future the exact version of the software the customer runs.
- In addition to the source code, include the documentation, tools, build scripts, test cases, artwork, and even libraries.
- Commit each logical change in a separate operation.

* Users
