programming/book/97_things_every_programmer_should_know.html
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> Teamwork</h2>
<div class="outline-text-2" id="text-19">
</div><div id="outline-container-sec-19-1" class="outline-3">
<h3 id="sec-19-1"><span class="section-number-3">19.1</span> Code Reviews</h3>
<div class="outline-text-3" id="text-19-1">
<p>
Instead of simply correcting mistakes in code, <span class="underline">the purpose of code reviews should be to share knowledge and establish common coding guidelines</span>. Sharing code with other programmers <span class="underline">enables collective code ownership</span>.
</p>

<p>
Introduce different roles for the review meeting, having one reviewer focus on documentation, another on exceptions, and a third to look at the functionality.
</p>

<p>
Code reviews will flow more easily if the team has coding conventions that are checked by tools.
</p>
</div>
</div>
<div id="outline-container-sec-19-2" class="outline-3">
<h3 id="sec-19-2"><span class="section-number-3">19.2</span> Pair Program</h3>
<div class="outline-text-3" id="text-19-2">
<p>
As a team, introduce pair programming to promote distribution of skills and knowledge.
</p>

<p>
Truck factor: how many team members would have to be hit by a truck before the team became unable to complete the final deliverable? In other words, how dependent is the delivery on certain team members? Is knowledge privileged or shared?
</p>
</div>
</div>
<div id="outline-container-sec-19-3" class="outline-3">
<h3 id="sec-19-3"><span class="section-number-3">19.3</span> Start from Yes</h3>
<div class="outline-text-3" id="text-19-3">
<p>
Starting from yes means working with your colleagues, not against them.
</p>
</div>
</div>
<div id="outline-container-sec-19-4" class="outline-3">
<h3 id="sec-19-4"><span class="section-number-3">19.4</span> Two Heads Are Better Than One</h3>
<div class="outline-text-3" id="text-19-4">
<p>
Lottery risk: one of your expert developers wins the lottery and
quits the next day.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> Testing</h2>
<div class="outline-text-2" id="text-20">
</div><div id="outline-container-sec-20-1" class="outline-3">
<h3 id="sec-20-1"><span class="section-number-3">20.1</span> Test for Required Behavior</h3>
<div class="outline-text-3" id="text-20-1">
<p>
Tests need to state contractual obligations rather than parrot implementations. They need to take a blackbox view of the units under test.
</p>
</div>
</div>
<div id="outline-container-sec-20-2" class="outline-3">
<h3 id="sec-20-2"><span class="section-number-3">20.2</span> Testing Is the Engineering Rigor of Software Development</h3>
<div class="outline-text-3" id="text-20-2">
<p>
Over the past few thousand years, engineers have developed mathematics and physics they can use for a structural solution without having to build it to see what it does. We don't have anything like that in software, and perhaps never will because software is in fact very different. the
building process in software is ridiculously cheap. We’ve developed an entire ecosystem of tools that make it easy to do just that: unit testing, mock objects, test harnesses.
</p>
</div>
</div>
<div id="outline-container-sec-20-3" class="outline-3">
<h3 id="sec-20-3"><span class="section-number-3">20.3</span> Test Precisely and Concretely</h3>
<div class="outline-text-3" id="text-20-3">
<p>
There are two ways of constructing a software design: one way is to make it so simple that there are obviously no deficiencies and the other is to make it so complicated that there are no obvious deficiencies.
</p>
</div>
</div>
<div id="outline-container-sec-20-4" class="outline-3">
<h3 id="sec-20-4"><span class="section-number-3">20.4</span> Test While You Sleep</h3>
<div class="outline-text-3" id="text-20-4">
<p>
More often than not, the test servers are idling overnight and over the weekend. You can use this to your advantage. Break down large test suite into two or more profiles:
</p>

<ul class="org-ul">
<li>A smaller, mandatory test profile that is quick to run will help to ensure that tests are run before each commit.
</li>
<li>Other test profiles can be automated to run overnight, ready to report their results in the morning.
</li>
</ul>

<p>
Longer-running tests, or soak tests, are vital for identifying memory leaks and other stability issues.
</p>
</div>
</div>
<div id="outline-container-sec-20-5" class="outline-3">
<h3 id="sec-20-5"><span class="section-number-3">20.5</span> When Programmers and Testers Collaborate</h3>
<div class="outline-text-3" id="text-20-5">
<ul class="org-ul">
<li>Less time spent sending bugs back and forth through the defect tracking system.
</li>
<li>Less time wasted trying to figure out whether something is a bug or a new feature.
</li>
</ul>

<p>
Acceptance Test-Driven Development (ATDD): Testers write and automate acceptance tests using the language of their domain with tools such as Fit (Framework for Integrated Test), and give to the programmers before the coding begins. Programmers write the fixtures to run the tests, and then code to make the tests pass. Defects are prevented because the tests clarify many of the initial ideas. These tests then become part of the regression suite.
</p>

<p>
When testers stop thinking that their only job is to break the software and find bugs in the programmers' code, programmers stop thinking that testers are "out to get them", and are more open to collaboration.
</p>
</div>
</div>
<div id="outline-container-sec-20-6" class="outline-3">
<h3 id="sec-20-6"><span class="section-number-3">20.6</span> Write Tests for People</h3>
<div class="outline-text-3" id="text-20-6">
<p>
Good tests act as documentation for the code they are testing. They describe how the code works.
</p>

<ul class="org-ul">
<li>Describe the context, starting point, or preconditions.
</li>
<li>Illustrate how the software is invoked.
</li>
<li>Describe the expected results or postconditions.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> Tools</h2>
<div class="outline-text-2" id="text-21">
</div><div id="outline-container-sec-21-1" class="outline-3">
<h3 id="sec-21-1"><span class="section-number-3">21.1</span> Command-Line Tools</h3>
<div class="outline-text-3" id="text-21-1">
<p>
Typically, when a tool is easy to use, it's because the tool is making decisions for you and doing a lot of things automatically, behind the scenes.
</p>

<p>
Command-line tools inherently support scripting, which allows for the automation of tasks such as producing scheduled daily builds, creating multiple versions of a project, and running test suites.
</p>
</div>
</div>
<div id="outline-container-sec-21-2" class="outline-3">
<h3 id="sec-21-2"><span class="section-number-3">21.2</span> Step Back and Automate</h3>
<div class="outline-text-3" id="text-21-2">
<ul class="org-ul">
<li>Automate repetitive tasks: version control, compiling, building JAR files, documentation generation, deployment, and reporting.
</li>
<li>Modern IDEs have thousands of potential settings, and it is essentially impossible to ensure that all team members have identical configurations. Build automation systems such as Ant or Autotools give control and repeatability.
</li>
<li>Do it early in a project when time is usually easier to find.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-21-3" class="outline-3">
<h3 id="sec-21-3"><span class="section-number-3">21.3</span> Unix Tools</h3>
<div class="outline-text-3" id="text-21-3">
<p>
Unix tools were developed in an age when a multiuser computer had 128KB
of RAM. The ingenuity that went into their design means that nowadays they can handle huge data sets extremely efficiently.
</p>

<p>
Most tools work like filters, processing just a single line at the time, meaning that there is no upper limit in the amount of data they can handle.
</p>

<p>
Unix commands executing as pipelines, which naturally distribute their load among the many processing units of modern multicore CPUs.
</p>
</div>
</div>
<div id="outline-container-sec-21-4" class="outline-3">
<h3 id="sec-21-4"><span class="section-number-3">21.4</span> Version Control</h3>
<div class="outline-text-3" id="text-21-4">
<p>
Put everything in your project under version control.
</p>

<ul class="org-ul">
<li>Tag release with a symbolic name to easily revisit in the future the exact version of the software the customer runs.
</li>
<li>In addition to the source code, include the documentation, tools, build scripts, test cases, artwork, and even libraries.
</li>
<li>Commit each logical change in a separate operation.
</li>
</ul>
</div>
</div>
</div>
