programming/book/97_things_every_programmer_should_know.org
** Customers Do Not Mean What They Say

Customers generally don't lie, but they speak in customer speak, not developer speak. They use their terms and their contexts. They leave out significant details.

- Challenge your customers early, and challenge them often.
- Try restating the problem 2 or 3 times.
- Have multiple people tell the same topic in separate conversations to uncover separate yet related facts.
- Using visual aids helps lengthen our attention span and increases the retention rate of the information.

#+begin_quote
When she saw the product, her exact words about the background color were, "When I said black, I meant white."
#+end_quote

** Read the Humanities

Our ability to understand one another does not arise from shared definitions, it arises from a shared experience. Language is largely metaphorical, and that these metaphors offer an insight into how we understand the world.

For users, tools only become objects of interest when they don't work.

When programmers ask users about their desires for a system, they tend to ask for definitions built out of predicates. This is very convenient for programmers. The terms in the predicates can very easily become attributes on a class or columns in a table. But that just isn't how people in general understand the world. They understand it in ways that are based on examples. 
** What Would the User Do?

We all tend to assume that other people think like us. Psychologists call this the false consensus bias.

The best way to find out how a user thinks is to watch one. _The best way to capture requirements is to watch users._

If you must have instructions or help text, make sure to locate it right next to problem areas.

Users tend to muddle through. They'll find a way that works and stick with it.

