programming/book/97_things_every_programmer_should_know.html
<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> Users</h2>
<div class="outline-text-2" id="text-22">
</div><div id="outline-container-sec-22-1" class="outline-3">
<h3 id="sec-22-1"><span class="section-number-3">22.1</span> Customers Do Not Mean What They Say</h3>
<div class="outline-text-3" id="text-22-1">
<p>
Customers generally don't lie, but they speak in customer speak, not developer speak. They use their terms and their contexts. They leave out significant details.
</p>

<ul class="org-ul">
<li>Challenge your customers early, and challenge them often.
</li>
<li>Try restating the problem 2 or 3 times.
</li>
<li>Have multiple people tell the same topic in separate conversations to uncover separate yet related facts.
</li>
<li>Using visual aids helps lengthen our attention span and increases the retention rate of the information.
</li>
</ul>

<blockquote>
<p>
When she saw the product, her exact words about the background color were, "When I said black, I meant white."
</p>
</blockquote>
</div>
</div>
<div id="outline-container-sec-22-2" class="outline-3">
<h3 id="sec-22-2"><span class="section-number-3">22.2</span> Read the Humanities</h3>
<div class="outline-text-3" id="text-22-2">
<p>
Our ability to understand one another does not arise from shared definitions, it arises from a shared experience. Language is largely metaphorical, and that these metaphors offer an insight into how we understand the world.
</p>

<p>
For users, tools only become objects of interest when they don't work.
</p>

<p>
When programmers ask users about their desires for a system, they tend to ask for definitions built out of predicates. This is very convenient for programmers. The terms in the predicates can very easily become attributes on a class or columns in a table. But that just isn't how people in general understand the world. They understand it in ways that are based on examples. 
</p>
</div>
</div>

<div id="outline-container-sec-22-3" class="outline-3">
<h3 id="sec-22-3"><span class="section-number-3">22.3</span> What Would the User Do?</h3>
<div class="outline-text-3" id="text-22-3">
<p>
We all tend to assume that other people think like us. Psychologists call this the false consensus bias.
</p>

<p>
The best way to find out how a user thinks is to watch one. <span class="underline">The best way to capture requirements is to watch users.</span>
</p>

<p>
If you must have instructions or help text, make sure to locate it right next to problem areas.
</p>

<p>
Users tend to muddle through. They'll find a way that works and stick with it.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-03-01 Wed 22:22</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
